var euBack = [
    "ВОЙТИ В КОРИЧНЕВЫЙ ТУННЕЛЬ",
    "ВЫСАДИТЬ ДЕСАНТ НА ШОКОЛАДНУЮ ФАБРИКУ",
    "ПРОНИКНУТЬ С ЧЁРНОГО ХОДА",
    "ЗАЙТИ К ПОПУ ЧАНСКОМУ",
    "ПОИГРАТЬ НА ЗАДНЕМ ДВОРИКЕ",
    "ПРОЗОНДИРОВАТЬ ЧЕРНОЗЁМ",
    "ПРОВЕСТИ ЭКСКУРСИЮ ПО КОРИЧНЕВЫМ ПЕЩЕРАМ",
    "ЗАВЕСТИ КОЖАНЫЙ ПОЕЗД В УЗКИЙ ТУННЕЛЬ",
    "ПРОВЕСТИ ДИВЕРСИОННУЮ ОПЕРАЦИЮ В ШАХТЕ",
    "С УТРА ЗАЙТИ В ШОКОЛАДНИЦУ",
    "РАЗРАБАТЫВАТЬ КРЕПКИЕ ГОРНЫЕ ПОРОДЫ",
    "ПРОЧИЩАТЬ ДЫМОХОД",
    "РАЗРАБАТЫВАТЬ УГОЛЬНУЮ ШАХТУ",
    "А ПРОХОДИТЬ ЧЕРЕЗ КРОТОВЫЕ НОРЫ В СКЛАДКАХ ГИПЕРПРОСТРАНСТВА",
    "СЪЕЗДИТЬ В ПОПЕНГАГЕН",
    "МЕСИТЬ ЧЕРНОЕ ТЕСТО С ПЕРЦЕМ",
    "ЗАПУСТИТЬ РАЗВЕДЧИКА ДЛЯ АНАЛИЗА МЕСТНОСТИ",
    "ВТОРГНУТЬСЯ СВОИМ МЕТЕОРОМ В ЧУЖУЮ АТМОСФЕРУ",
    "ОТКРЫТЬ ЧЕРНЫЙ ЯЩИК" ,
    "СОБИРАТЬСЯ К ПЬЕРУ Д'АЧЕЛЛО" ,
    "ОБОРОЗДИТЬ ПРОСТОРЫ ЕЁ ТЁМНОЙ ВСЕЛЕННОЙ",
    "БИТЬ С ТЫЛА ТЯЖЕЛОЙ АРТИЛЛЕРИЕЙ" 
];

var euFront = [
    "ЗАПУСТИТЬ КОЖАНОГО ПИТОНА В КЛЕТКУ С ПОВЫШЕННОЙ ВЛАЖНОСТЬЮ",
    "ЗОНДИРОВАТЬ КРАСНУЮ ПЛАНЕТУ",
    "УСТРОИТЬ ВЗЛОМ С ПРОНИКНОВЕНИЕМ",
    "ВОЙТИ БЕЗ СТУКА В ГОСТИ",
    "УВЛАЖНИТЬ ПОЧВУ БЕЛЫМ УДОБРЕНИЕМ",
    "ПОКРЫТЬ БЕЛОЙ ГЛАЗУРЬЮ РОЗОВЫЙ ТОРТ",
    "ПРОВЕСТИ ЭКСКУРСИЮ ПО РОЗОВЫМ ПЕЩЕРАМ",
    "ЗАВЕСТИ КОЖАНЫЙ ПОЕЗД В УЗКИЙ ТУННЕЛЬ"
]